app/views/admin/sclasses/_form.html.erb

SELECT "grades".* FROM "grades" WHERE (id>1) ORDER BY gyear
---
    <%= cell(t("general.name"), (f.text_field :name))%>
    <%= cell(t("admin.orgs.grade"),f.collection_select(:grade_id, Grade.where("id>1").order("gyear"), :id, :name)) %>