app/controllers/admin/announcements_controller.rb

  def index
    @announcements = Announcement.all
---
SELECT "announcements".* FROM "announcements"

  def show
    @announcement = Announcement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @announcement = Announcement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @announcement = Announcement.new(params[:announcement])

    respond_to do |format|
      if @announcement.save
---
INSERT INTO "announcements" ("created_at", "ends_at", "headline", "message", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @announcement = Announcement.find(params[:id])
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @announcement = Announcement.find(params[:id])
    @announcement.destroy
---
SELECT "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "announcements" WHERE "announcements"."id" = ?  [["id", 1]]