app/controllers/admin/orgs_controller.rb

  def index
    begin
      @school = Grade.find(1);
---
SELECT "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 1]]

  def edit_school
    @school = Grade.find(1);
---
SELECT "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 1]]

  def update_school
    @school = Grade.find(1)

    respond_to do |format|
      if @school.update_attributes(params[:grade])
---
SELECT "grades".* FROM "grades" WHERE "grades"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "grades" SET "description" = '成都市七中育才学校的前身是1957年开办的一所市属普通中学。校名几度演变，初名为成都市第35中学。1997年，为适应成都现代教育发展需要，改变35中的薄弱现状，在成都市教育局领导下，依托全国示范性中学——成都七中办学，学校改名为成都市七中育才学校。2006年7月，按属地化管理要求移交锦江区教育局管理。', "updated_at" = '2012-09-03 05:32:50.087850' WHERE "grades"."id" = 1