app/controllers/admin/roles_controller.rb

  def show
  	@role=Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @role = Role.new(params[:role])
   # debugger
    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("description", "name") VALUES (?, ?)  [["description", "学生角色"], ["name", "student"]]