app/controllers/admin/sclasses_controller.rb

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @sclass  = Sclass.find(params[:id])

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @sclass = Sclass.find(params[:id])

INSERT INTO "sclasses" ("address", "created_at", "ctype", "description", "grade_id", "name", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @sclass = Sclass.new(params[:sclass])

    respond_to do |format|
      if @sclass.save

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "sclasses" SET "name" = '201403班', "updated_at" = '2012-09-04 06:18:50.248878' WHERE "sclasses"."id" = 1
---
  def update
    @sclass = Sclass.find(params[:id])

    respond_to do |format|
      if @sclass.update_attributes(params[:sclass])

SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "users".* FROM "users" WHERE "users"."name" = 'YCS14A02' LIMIT 1
INSERT INTO "users" ("activated_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "deleted_at", "email", "encrypted_password", "identity_url", "language", "last_sign_in_at", "last_sign_in_ip", "login", "name", "remember_created_at", "remember_token", "reset_password_token", "sign_in_count", "sname", "state", "twitter_token", "unumber", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "name" = 'sdf', "sname" = 'sdf', "unumber" = 'sdf', "encrypted_password" = '$2a$10$6D8Uzx71KSrm9w.agTR0qOkNnSvJuxSce66Ad8mA7b4ZL3V3xYjMy', "language" = 'cn', "email" = 'sdf@yucai.cn', "created_at" = '2012-09-05 06:48:36.390721', "updated_at" = '2012-09-05 06:48:36.390721', "state" = 'active' WHERE "users"."id" = 10
---
  def add_student
    @sclass= Sclass.find(params[:id])

    @student = User.find_by_name(params[:user][:name])
    if @student.nil?
      params[:user][:password]="hello123"
      params[:user][:password_confirmation]="hello123"
      params[:user][:language]="cn"
      params[:user][:email]=params[:user][:name]+"@yucai.cn"

      @student = User.new(params[:user])
    end

    respond_to do |format|
      if @student.save