app/views/admin/orgs/index.html.erb

	<td><%= grade1.gyear %></td>
	<td><%= grade1.sclasses.count %></td>
---
SELECT "sclasses".* FROM "sclasses" WHERE "sclasses"."grade_id" = 2 ORDER BY name, name
SELECT COUNT(*) FROM "sclasses" WHERE "sclasses"."grade_id" = 2