app/views/admin/users/show.html.erb

SELECT "roles".* FROM "roles"
---
		<ul>
			<% Role.all.each do |x| -%>

SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
	<%= cell t('activerecord.attributes.user.language'), h(@user.language) %>
	<%= cell t('activerecord.attributes.user.roles'), @user.roles.map{|x| x.name.humanize }.join(", ") %>